Repository: manaflow-ai/cmux
Catalog: ios/CmuxiOS/Sources/CmuxiOSComposer/Resources/Localizable.xcstrings
Source language: en
Languages: ja

# composer.agent
source: Agent
ja: エージェント

# composer.agent.none
source: No agent
ja: エージェントなし

# composer.attach
source: Attach
ja: 添付

# composer.attach.failed
source: Failed
ja: 失敗

# composer.attach.camera
source: Camera
ja: カメラ

# composer.attach.files
source: Files
ja: ファイル

# composer.attach.photos
source: Photos
ja: 写真

# composer.attach.remove
source: Remove
ja: 削除

# composer.attach.uploading
source: Uploading
ja: アップロード中

# composer.blocker.empty
source: Write a prompt to send.
ja: 送信するにはプロンプトを入力してください。

# composer.blocker.no-agent
source: Choose an agent.
ja: エージェントを選択してください。

# composer.blocker.no-agents
source: This Mac hasn't reported any agents.
ja: このMacはエージェントを報告していません。

# composer.blocker.offline
source: Offline. Your draft is kept.
ja: オフラインです。下書きは保持されます。

# composer.blocker.unreachable
source: This Mac is unreachable. Your draft is kept.
ja: このMacに接続できません。下書きは保持されます。

# composer.blocker.upload-failed
source: An attachment failed to upload. Remove it to send.
ja: 添付ファイルのアップロードに失敗しました。削除すると送信できます。

# composer.blocker.uploads
source: Waiting for attachments to upload.
ja: 添付ファイルのアップロードを待っています。

# composer.cancel
source: Cancel
ja: キャンセル

# composer.close
source: Close
ja: 閉じる

# composer.dictate
source: Dictate
ja: 音声入力

# composer.dictate.denied
source: Allow Speech Recognition and the microphone in Settings to dictate.
ja: 音声入力するには、設定で音声認識とマイクを許可してください。

# composer.dictate.stop
source: Stop Dictation
ja: 音声入力を停止

# composer.dictate.unavailable
source: Dictation isn't available right now.
ja: 現在、音声入力は利用できません。

# composer.drafts
source: Drafts
ja: 下書き

# composer.effort
source: Effort
ja: 推論量

# composer.effort.high
source: High
ja: 高

# composer.effort.low
source: Low
ja: 低

# composer.effort.max
source: Max
ja: 最大

# composer.effort.medium
source: Medium
ja: 中

# composer.effort.xhigh
source: Extra High
ja: 非常に高い

# composer.floating
source: New Task
ja: 新規タスク

# composer.mock
source: Mock data
ja: モックデータ

# composer.model
source: Model
ja: モデル

# composer.model.default
source: Default model
ja: デフォルトのモデル

# composer.new-task
source: New Task
ja: 新規タスク

# composer.outcome.not-delivered
source: Not confirmed. Your draft is kept; sending again won't start a second task.
ja: 確認できませんでした。下書きは保持されます。再送信しても2つ目のタスクは開始されません。

# composer.outcome.open
source: Open
ja: 開く

# composer.outcome.refused
source: The Mac refused: %@
ja: Macが拒否しました: %@

# composer.outcome.started
source: Started in %@
ja: %@ で開始しました

# composer.outcome.unsupported
source: This Mac doesn't accept tasks yet.
ja: このMacはまだタスクを受け付けていません。

# composer.prompt.label
source: Prompt
ja: プロンプト

# composer.prompt.placeholder
source: Describe the task. Type / for templates, @ for files.
ja: タスクを説明してください。/ でテンプレート、@ でファイルを挿入できます。

# composer.save
source: Save
ja: 保存

# composer.send
source: Send
ja: 送信

# composer.sending
source: Sending…
ja: 送信中…

# composer.target.choose
source: Choose a Mac
ja: Macを選択

# composer.target.hint
source: Opens the Mac and workspace picker
ja: Macとワークスペースの選択画面を開きます

# composer.target.new-workspace
source: New workspace
ja: 新しいワークスペース

# composer.task.done
source: Done
ja: 完了

# composer.task.failed
source: Failed
ja: 失敗

# composer.task.needs-input
source: Needs input
ja: 入力待ち

# composer.task.queued
source: Queued
ja: 待機中

# composer.task.running
source: Running
ja: 実行中

# composer.template.explain.body
source: Explain how this part of the code works and where its state lives:
ja: このコードの動作と、状態がどこにあるかを説明してください:

# composer.template.explain.title
source: Explain code
ja: コードを説明

# composer.template.fix-tests.body
source: Run the test suite, find the failing tests, fix the cause, and rerun until they pass.
ja: テストを実行し、失敗しているテストを見つけて原因を修正し、すべて通るまで再実行してください。

# composer.template.fix-tests.title
source: Fix failing tests
ja: 失敗したテストを修正

# composer.template.pr.body
source: Commit the work on a new branch, push it, and open a pull request with a short summary.
ja: 作業を新しいブランチにコミットしてプッシュし、短い概要付きでプルリクエストを作成してください。

# composer.template.pr.title
source: Open a pull request
ja: プルリクエストを作成

# composer.template.review.body
source: Review the uncommitted changes for bugs and risky edge cases. List findings by severity.
ja: コミットされていない変更に、バグや危険なエッジケースがないかレビューし、重大度順に一覧にしてください。

# composer.template.review.title
source: Review changes
ja: 変更をレビュー

# composer.templates
source: Templates
ja: テンプレート

# composer.templates.delete
source: Delete Saved Template
ja: 保存したテンプレートを削除

# composer.templates.name
source: Template name
ja: テンプレート名

# composer.templates.save
source: Save Prompt as Template…
ja: プロンプトをテンプレートとして保存…

# composer.title
source: Compose
ja: 作成
